<h1>Содержание<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Описание-проекта." data-toc-modified-id="Описание-проекта.-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Описание проекта.</a></span></li><li><span><a href="#Подключение-к-базе-данных." data-toc-modified-id="Подключение-к-базе-данных.-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Подключение к базе данных.</a></span></li><li><span><a href="#Таблицы-базы-данных." data-toc-modified-id="Таблицы-базы-данных.-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Таблицы базы данных.</a></span></li><li><span><a href="#Задания-проекта." data-toc-modified-id="Задания-проекта.-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Задания проекта.</a></span></li></ul></div>

## Описание проекта.

Компания-заказчик купила сервис для чтения книг по подписке.

Задача - проанализировать базу данных, чтобы помочь сформулировать ценностное предложение для нового продукта.

База данных содержит информацию о книгах, издательствах, авторах, а также пользовательские обзоры книг.

## Подключение к базе данных.

In [1]:
# импортируем библиотеки
import pandas as pd 
from sqlalchemy import create_engine

In [2]:
# устанавливаем параметры
db_config = {'user': '___', # имя пользователя
 'pwd' : '___', # пароль
 'host': '___', 
 'port': 6432, # порт подключения
 'db': 'data-analyst-final-project-db'} # название базы данныхи

In [3]:
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'], 
 db_config['pwd'], 
 db_config['host'], 
 db_config['port'], 
 db_config['db'])

In [4]:
# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

## Таблицы базы данных.

In [5]:
query='''SELECT *
         FROM books
         LIMIT 10;'''   

pd.io.sql.read_sql(query,con = engine)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268
5,6,257,1st to Die (Women's Murder Club #1),424,2005-05-20,116
6,7,258,2nd Chance (Women's Murder Club #2),400,2005-05-20,116
7,8,260,4th of July (Women's Murder Club #4),448,2006-06-01,318
8,9,563,A Beautiful Mind,461,2002-02-04,104
9,10,445,A Bend in the Road,341,2005-04-01,116

**Таблица books**
Содержит данные о книгах:
- book_id — идентификатор книги;
- author_id — идентификатор автора;
- title — название книги;
- num_pages — количество страниц;
- publication_date — дата публикации книги;
- publisher_id — идентификатор издателя.

In [6]:
query='''SELECT *
         FROM authors
         LIMIT 10;'''   

pd.io.sql.read_sql(query,con = engine)

   author_id                                author
0          1                            A.S. Byatt
1          2        Aesop/Laura Harris/Laura Gibbs
2          3                       Agatha Christie
3          4                         Alan Brennert
4          5              Alan Moore/David   Lloyd
5          6                            Alan Paton
6          7           Albert Camus/Justin O'Brien
7          8                         Aldous Huxley
8          9    Aldous Huxley/Christopher Hitchens
9         10  Aleksandr Solzhenitsyn/H.T. Willetts

**Таблица authors**

Содержит данные об авторах:
- author_id — идентификатор автора;
- author — имя автора.

In [7]:
query='''SELECT *
         FROM ratings
         LIMIT 10;'''   

pd.io.sql.read_sql(query,con = engine)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2
5          6        3  johnsonamanda       4
6          7        3    scotttamara       5
7          8        3    lesliegibbs       5
8          9        4    abbottjames       5
9         10        4   valenciaanne       4

**Таблица ratings**

Содержит данные о пользовательских оценках книг:
- rating_id — идентификатор оценки;
- book_id — идентификатор книги;
- username — имя пользователя, оставившего оценку;
- rating — оценка книги.

In [8]:
query='''SELECT *
         FROM reviews
         LIMIT 10;'''   

pd.io.sql.read_sql(query,con = engine)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...
5,6,3,lesliegibbs,Analysis no several cause international.
6,7,4,valenciaanne,One there cost another. Say type save. With pe...
7,8,4,abbottjames,Within enough mother. There at system full rec...
8,9,5,npowers,Thank now focus realize economy focus fly. Ite...
9,10,5,staylor,Game push lot reduce where remember. Including...

**Таблица reviews**

Содержит данные о пользовательских обзорах на книги:
- review_id — идентификатор обзора;
- book_id — идентификатор книги;
- username — имя пользователя, написавшего обзор;
- text — текст обзора.

In [9]:
query='''SELECT *
         FROM publishers
         LIMIT 10;'''   

pd.io.sql.read_sql(query,con = engine)

   publisher_id                                publisher
0             1                                      Ace
1             2                                 Ace Book
2             3                                Ace Books
3             4                            Ace Hardcover
4             5        Addison Wesley Publishing Company
5             6                                  Aladdin
6             7                       Aladdin Paperbacks
7             8                             Albin Michel
8             9                          Alfred A. Knopf
9            10  Alfred A. Knopf Books for Young Readers

**Таблица publishers**

Содержит данные об издательствах:
- publisher_id — идентификатор издательства;
- publisher — название издательства.

## Задания проекта.

**1. Посчитайте, сколько книг вышло после 1 января 2000 года**

In [10]:
query='''SELECT COUNT(book_id) AS books_after_01_2000
         FROM books
         WHERE publication_date > '2000-01-01';'''   

pd.io.sql.read_sql(query,con = engine)

   books_after_01_2000
0                  819

**2. Для каждой книги посчитайте количество обзоров и среднюю оценку**

In [11]:
query='''WITH
         b AS (SELECT book_id,
                      title
               FROM books),
         rat AS (SELECT book_id,
                      ROUND(AVG(rating), 2) AS avg_rating
               FROM ratings
               GROUP BY book_id),
         rev AS (SELECT book_id,
                        COUNT(review_id) AS number_of_reviews
                 FROM reviews
                 GROUP BY book_id)
         SELECT b.title,
                rev.number_of_reviews,
                rat.avg_rating
         FROM b LEFT JOIN rat ON b.book_id=rat.book_id
         LEFT JOIN rev ON rat.book_id=rev.book_id
         ORDER BY b.title;'''   

pd.io.sql.read_sql(query,con = engine)

,title,number_of_reviews,avg_rating
0,'Salem's Lot,2.0,3.67
1,1 000 Places to See Before You Die,1.0,2.50
2,13 Little Blue Envelopes (Little Blue Envelope...,3.0,4.67
3,1491: New Revelations of the Americas Before C...,2.0,4.50
4,1776,4.0,4.00
...,...,...,...
995,Wyrd Sisters (Discworld #6; Witches #2),3.0,3.67
996,Xenocide (Ender's Saga #3),3.0,3.40
997,Year of Wonders,4.0,3.20
998,You Suck (A Love Story #2),2.0,4.50
999,Zen and the Art of Motorcycle Maintenance: An ...,4.0,3.83

**3. Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры**

In [12]:
query='''SELECT publisher
         FROM publishers
         WHERE publisher_id IN (SELECT publisher_id
                                FROM books
                                WHERE num_pages > 50
                                GROUP BY publisher_id
                                ORDER BY COUNT(book_id) DESC
                                LIMIT 1);'''   

pd.io.sql.read_sql(query,con = engine)

       publisher
0  Penguin Books

**4. Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками**

In [13]:
query='''WITH
         rat AS (SELECT book_id,
                        AVG(rating) AS avg_rating
                 FROM ratings
                 GROUP BY book_id
                 HAVING COUNT(rating_id) >=50)
         SELECT author
         FROM authors
         WHERE author_id IN (SELECT b.author_id
                             FROM rat
                             LEFT JOIN books AS b ON rat.book_id=b.book_id
                             GROUP BY author_id
                             ORDER BY AVG(rat.avg_rating) DESC
                             LIMIT 1);'''   

pd.io.sql.read_sql(query,con = engine)

                       author
0  J.K. Rowling/Mary GrandPré

**5. Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.**

In [14]:
query='''SELECT (COUNT(review_id)/ COUNT(DISTINCT(username))) AS avg_review
         FROM reviews
         WHERE username in (SELECT username
                            FROM ratings
                            GROUP BY username
                            HAVING COUNT(rating_id) > 50);'''   

pd.io.sql.read_sql(query,con = engine)

   avg_review
0          24